# Standard VS Code Extensions
# ---------------------------------
# Format:  publisher.name[@version]
# - One extension per line
# - Lines starting with '#' are ignored
# - Inline '# ...' comments are stripped
# - Append '@<version>' to pin an exact version (otherwise latest is installed)
#
# Example of a pinned version:
#   ms-python.python@2024.0.1
#
# To regenerate this list from a reference machine:
#   code --list-extensions --show-versions > extensions.txt

# --- Language support ---
ms-python.python
golang.go
ms-vscode.powershell

# --- Remote / containers ---
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers

# --- Git  ---
eamodio.gitlens
editorconfig.editorconfig
streetsidesoftware.code-spell-checker
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
gitlab.gitlab-workflow

# --- Quality of Life / Time Savers ---
esbenp.prettier-vscode
ms-python.pylint
ms-python.black-formatter
ms-python.debugpy
foxundermoon.shell-format
mads-hartmann.bash-ide-vscode
naumovs.color-highlight
timonwong.shellcheck
vue.volar
ms-python.vscode-pylance
ms-python.vscode-python-envs

# --- Shell / sysadmin ---
timonwong.shellcheck
foxundermoon.shell-format

# --- Jupyter ---
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow






